{
    "上の句（ひらがな）": "下の句",
    "あきのたのかりほのいほのとまをあらみ": "あきの",
    "はるすぎてなつきにけらししろたへの": "はるす",
    "あしびきのやまどりのをのしだりをの": "あし",
    "たごのうらにうちいでてみればしろたへの": "たご",
    "おくやまにもみぢふみわけなくしかの": "おく",
    "かささぎのわたせるはしにおくしもの": "かさ",
    "あまのはらふりさけみればかすがなる": "あまの",
    "わがいほはみやこのたつみしかぞすむ": "わがい",
    "はなのいろはうつりにけりないたづらに": "はなの",
    "これやこのゆくもかへるもわかれては": "これ",
    "わたのはらやそしまかけてこぎいでぬと": "わたのはらや",
    "あまつかぜくものかよひぢふきとぢよ": "あまつ",
    "つくばねのみねよりおつるみなのがは": "つく",
    "みちのくのしのぶもぢずりたれゆゑに": "みち",
    "きみがためはるののにいでてわかなつむ": "きみがためは",
    "たちわかれいなばのやまのみねにおふる": "たち",
    "ちはやぶるかみよもきかずたつたがは": "ちは",
    "すみのえのきしによるなみよるさへや": "す",
    "なにはがたみじかきあしのふしのまも": "なにはが",
    "わびぬればいまはたおなじなにはなる": "わび",
    "いまこむといひしばかりにながつきの": "いまこ",
    "ふくからにあきのくさきのしをるれば": "ふ",
    "つきみればちぢにものこそかなしけれ": "つき",
    "このたびはぬさもとりあへずたむけやま": "この",
    "なにしおはばあふさかやまのさねかづら": "なにし",
    "をぐらやまみねのもみぢばこころあらば": "をぐ",
    "みかのはらわきてながるるいづみがは": "みかの",
    "やまざとはふゆぞさびしさまさりける": "やまざ",
    "こころあてにをらばやをらむはつしもの": "こころあ",
    "ありあけのつれなくみえしわかれより": "ありあ",
    "あさぼらけありあけのつきとみるまでに": "あさぼらけあ",
    "やまがはにかぜのかけたるしがらみは": "やまが",
    "ひさかたのひかりのどけきはるのひに": "ひさ",
    "たれをかもしるひとにせむたかさごの": "だれ",
    "ひとはいさこころもしらずふるさとは": "ひとは",
    "なつのよはまだよひながらあけぬるを": "なつ",
    "しらつゆにかぜのふきしくあきののは": "しら",
    "わすらるるみをばおもはずちかひてし": "わすら",
    "あさぢふのをののしのはらしのぶれど": "あざじ",
    "しのぶれどいろにいでにけりわがこひは": "しの",
    "こひすてふわがなはまだきたちにけり": "こい",
    "ちぎりきなかたみにそでをしぼりつつ": "ちぎりき",
    "あひみてののちのこころにくらぶれば": "あい",
    "あふことのたえてしなくはなかなかに": "あうこ",
    "あはれともいふべきひとはおもほえで": "あわれ",
    "ゆらのとをわたるふなびとかぢをたえ": "ゆら",
    "やへむぐらしげれるやどのさびしきに": "やえ",
    "かぜをいたみいはうつなみのおのれのみ": "かぜを",
    "みかきもりゑじのたくひのよるはもえ": "みかき",
    "きみがためをしからざりしいのちさへ": "きみがためお",
    "かくとだにえやはいぶきのさしもぐさ": "かく",
    "あけぬればくるるものとはしりながら": "あけ",
    "なげきつつひとりぬるよのあくるまは": "なげき",
    "わすれじのゆくすゑまではかたければ": "わすれ",
    "たきのおとはたえてひさしくなりぬれど": "たき",
    "あらざらむこのよのほかのおもひでに": "あらざ",
    "めぐりあひてみしやそれともわかぬまに": "め",
    "ありまやまゐなのささはらかぜふけば": "ありま",
    "やすらはでねなましものをさよふけて": "やす",
    "おほえやまいくののみちのとほければ": "おおえ",
    "いにしへのならのみやこのやへざくら": "いに",
    "よをこめてとりのそらねははかるとも": "よを",
    "いまはただおもひたえなむとばかりを": "いまは",
    "あさぼらけうぢのかはぎりたえだえに": "あさぼらけう",
    "うらみわびほさぬそでだにあるものを": "うら",
    "もろともにあはれとおもへやまざくら": "もろ",
    "はるのよのゆめばかりなるたまくらに": "はるの",
    "こころにもあらでうきよにながらへば": "こころに",
    "あらしふくみむろのやまのもみぢばは": "あらし",
    "さびしさにやどをたちいでてながむれば": "さ",
    "ゆふさればかどたのいなばおとづれて": "ゆう",
    "おとにきくたかしのはまのあだなみは": "おと",
    "たかさごのをのへのさくらさきにけり": "たか",
    "うかりけるひとをはつせのやまおろしよ": "うか",
    "ちぎりおきしさせもがつゆをいのちにて": "ちぎりお",
    "わたのはらこぎいでてみればひさかたの": "わたのはらこ",
    "せをはやみいはにせかるるたきがはの": "せ",
    "あはぢしまかよふちどりのなくこゑに": "あわぢ",
    "あきかぜにたなびくくものたえまより": "あきか",
    "ながからむこころもしらずくろかみの": "ながか",
    "ほととぎすなきつるかたをながむれば": "ほ",
    "おもひわびさてもいのちはあるものを": "おも",
    "よのなかよみちこそなけれおもひいる": "よのなかよ",
    "ながらへばまたこのごろやしのばれむ": "ながら",
    "よもすがらものおもふころはあけやらで": "よも",
    "なげけとてつきやはものをおもはする": "なげけ",
    "むらさめのつゆもまだひぬまきのはに": "む",
    "なにはえのあしのかりねのひとよゆゑ": "なにわえ",
    "たまのをよたえなばたえねながらへば": "たま",
    "みせばやなをじまのあまのそでだにも": "みせ",
    "きりぎりすなくやしもよのさむしろに": "きり",
    "わがそではしほひにみえぬおきのいしの": "わがそ",
    "よのなかはつねにもがもななぎさこぐ": "よのなかは",
    "みよしののやまのあきかぜさよふけて": "みよ",
    "おほけなくうきよのたみにおほふかな": "おおけ",
    "はなさそふあらしのにはのゆきならで": "はなさ",
    "こぬひとをまつほのうらのゆふなぎに": "こぬ",
    "かぜそよぐならのをがはのゆふぐれは": "かぜそ",
    "ひともをしひともうらめしあぢきなく": "ひとも",
    "ももしきやふるきのきばのしのぶにも": "もも"
}
